const permissions = {
    createPharmacist: "إضافة صيدلي",
    updatePharmacist: "تعديل صيدلي",
    deletePharmacist: "حذف صيدلي",
    listPharmacists: "قراءة معلومات الصيدلي",
    getPharmacist: "قراءة معلومات الصيدلي",
    uploadPharmacistImages: "رفع صور الصيدلي",
    downloadPharmacistImages: "تحميل صور الصيدلي",

    updateFeesValues: "تعديل معلومات الرسوم",
    listFees: "قراءة معلومات الرسوم",

    createInvoice: "إضافة فاتورة",
    updateInvoice: "تعديل فاتورة",
    deleteInvoice: "حذف فاتورة",
    listInvoices: "قراءة معلومات فاتورة",
    getInvoice: "قراءة معلومات فاتورة",

    listUsers: "قراءة معلومات المستخدمين",
    readUser: "قراءة معلومات المستخدمين",
    createUser: "إضافة مستخدم",
    deleteUser: "حذف مستخدم",
    updateUser: "تعديل مستخدم",

    listRoles: "قراءة معلومات الأدوار",
    getRole: "قراءة معلومات الأدوار",
    createRole: "إضافة دور",
    deleteRole: "حذف دور",
    updateRole: "تعديل دور",
    listPermissions: "قراءة معلومات الأذونات",

    getInvoicesReport: "قراءة تقرير الفواتير",

    getDetailedPrints: "قراءة معلومات المطبوعات",
    updateDetailedPrints: "تعديل معلومات المطبوعات",
    updateFinesDate: "تعديل تاريخ الغرامات",
    updateReRegistrationtDate: "تعديل تاريخ إعادة القيد",

    getFixedDates: "قراءة معلومات التواريخ الثابتة",
};

export const ReadablePermissions = {
    الصيدلي: ["إضافة صيدلي", "تعديل صيدلي", "حذف صيدلي", "قراءة معلومات الصيدلي", "رفع صور الصيدلي", "تحميل صور الصيدلي"],
    الرسوم: ["تعديل معلومات الرسوم", "قراءة معلومات الرسوم", "قراءة معلومات المطبوعات", "تعديل معلومات المطبوعات"],
    الفواتير: ["إضافة فاتورة", "تعديل فاتورة", "حذف فاتورة", "قراءة معلومات فاتورة"],
    المستخدمين: ["إضافة مستخدم", "تعديل مستخدم", "حذف مستخدم", "قراءة معلومات المستخدمين"],
    الأدوار: ["قراءة معلومات الأدوار", "قراءة معلومات الأذونات", "إضافة دور", "تعديل دور", "حذف دور"],
    "التواريخ الثابتة": ["تعديل تاريخ الغرامات", "تعديل تاريخ إعادة القيد", "قراءة معلومات التواريخ الثابتة"],
    التقارير: ["قراءة تقرير الفواتير"],
};

export default permissions;
