const permissions = {
    createPharmacist: "إضافة صيدلي",
    updatePharmacist: "تعديل صيدلي",
    deletePharmacist: "حذف صيدلي",
    listPharmacists: "قراءة معلومات الصيدلي",
    getPharmacist: "قراءة معلومات الصيدلي",

    updateFeesValues: "تعديل معلومات الرسوم",
    listFees: "قراءة معلومات الرسوم",

    createInvoice: "إضافة فاتورة",
    updateInvoice: "تعديل فاتورة",
    deleteInvoice: "حذف فاتورة",
    updateInvoiceStatus: "تعديل فاتورة",
    listInvoices: "قراءة معلومات فاتورة",
    getInvoice: "قراءة معلومات فاتورة",

    listPracticeTypes: "قراءة معلومات المزاولات",

    listUsers: "قراءة معلومات المستخدمين",
    readUser: "قراءة معلومات المستخدمين",
    createUser: "إضافة مستخدم",
    deleteUser: "حذف مستخدم",
    updateUser: "تعديل مستخدم",

    listRoles: "قراءة معلومات الأدوار",
    createRole: "إضافة دور",
    deleteRole: "حذف دور",
    updateRole: "تعديل دور",
    listPermissions: "قراءة معلومات الأذونات",

    updateFinesDate: "تعديل تاريخ الغرامات",
    updateRistrectDate: "تعديل تاريخ القيد",
    listFixedDates: "قراءة معلومات التواريخ الثابتة",
};

export const ReadablePermissions = {
    الصيدلي: ["إضافة صيدلي", "تعديل صيدلي", "حذف صيدلي", "قراءة معلومات الصيدلي"],
    الرسوم: ["تعديل معلومات الرسوم", "قراءة معلومات الرسوم"],
    الفواتير: ["إضافة فاتورة", "تعديل فاتورة", "حذف فاتورة", "قراءة معلومات فاتورة"],
    المزاولات: ["قراءة معلومات المزاولات"],
    المستخدمين: ["إضافة مستخدم", "تعديل مستخدم", "حذف مستخدم", "قراءة معلومات المستخدمين"],
    الأدوار: ["قراءة معلومات الأدوار", "تعديل أذونات", "قراءة معلومات الأذونات", "إضافة دور", "تعديل دور", "حذف دور"],
    "التواريخ الثابتة": ["تعديل تاريخ الغرامات", "تعديل تاريخ القيد", "قراءة معلومات التواريخ الثابتة"],
};

export default permissions;
