export enum LicenseType {
    TEMPORARY = "مؤقت",
    PERMANENT = "دائم",
}
export enum Gender {
    MALE = "ذكر",
    FEMALE = "أنثى",
}
export enum UniversityDegree {
    BACHELOR = "بكالوريوس صيدلة",
    DIPLOMA = "دبلوم صيدلة",
    PHD = "دكتوراه صيدلة",
    MASTERS = "ماجستير صيدلة",
    BOARD = "بورد صيدلة",
}

export enum PracticeState {
    UNPRACTICED = "غير مزاول",
    PRACTICED = "مزاول",
}
export enum TransferReason {
    RETIREMENT = "تقاعد",
    DEATH = "وفاة",
    TRANSFER_TO_BRANCH = "نقل إلى فرع",
    CANCELLATION_OF_REGISTRATION = "ترقين قيد",
}

export enum Syndicate {
    CENTRAL = "نقابة الصيادلة المركزية",
    DAMASCUS = "نقابة صيادلة دمشق",
    SUWAYDA = "نقابة صيادلة السويداء",
    DEIR_ZOR = "نقابة صيادلة دير الزور",
    HASAKEH = "نقابة صيادلة الحسكة",
    QAMISHLI = "نقابة صيادلة القامشلي",
    IDLIB = "نقابة صيادلة إدلب",
    RAQQA = "نقابة صيادلة الرقة",
    DAMASCUS_COUNTRYSIDE = "نقابة صيادلة ريف دمشق",
    ALEPPO = "نقابة صيادلة حلب",
    HOMS = "نقابة صيادلة حمص",
    HAMA = "نقابة صيادلة حماة",
    LATAKIA = "نقابة صيادلة اللاذقية",
    TARTOUS = "نقابة صيادلة طرطوس",
    DARAA = "نقابة صيادلة درعا",
    QUNEITRA = "نقابة صيادلة القنيطرة",
}
export const licensesInfo = {
    practiceType: [
        "مكاتب علمية-مندوبي دعاية",
        "قيد النقل",
        "متقاعد",
        "مزاولة",
        "في النقابة المركزية",
        "ترقين قيد",
        "صيدليات-خاصة",
        "صيدليات-عامة المعلمين او صيادلة عمالية",
        "إدارة فنية-صيدليات خاصة",
        "إدارة فنية-صيدليات عامة",
        "مستودعات-أدوية",
        "مستودعات-كيميائية",
        "مستودعات-بيطرية",
        "الموظفين-موظف",
        "الموظفين-مقيم",
        "الموظفين-معيد في كلية الصيدلة",
        "معامل الأدوية-مدير فني في معمل أدوية",
        "معامل الأدوية- رئيس خط إنتاج",
        "معامل الأدوية-صيدلي في معمل",
        "معامل الأدوية-منشأة مطهرات",
        "معامل الأدوية-شركة مبيدات حشرية",
        "معامل الأدوية-منشأة تجميل",
        "مخابر-خاصة",
        "مخابر-موظف+مخبر طبي",
        "متابعة الدراسة",
        "مكاتب علمية-مدراء فنيين",
        "مكاتب علمية-مندوبي دعاية",
        "خدمة إلزامية",
        "خارج القطر-عمل",
        "خارج القطر-دراسة",
        "مشطوب قيدهم",
        "بدون عمل",
        "أوضاع أخرى-صيدلي إضافي في صيدلية",
        "أوضاع أخرى-في مستودع",
    ],
};
