const permissions = {
    createPharmacist: "إضافة صيدلي",
    updatePharmacist: "تعديل صيدلي",
    deletePharmacist: "حذف صيدلي",
    listPharmacists: "قراءة معلومات الصيدلي",
    getPharmacist: "قراءة معلومات الصيدلي",
    exportPharmacistsAsExcel: "تصدير معلومات الصيادلة على شكل إكسل",
    downloadPharmacistImages: "تحميل صور الصيدلي",
    printPharmacist: "طباعة معلومات الصيدلي",

    updateFeesValues: "تعديل معلومات الرسوم",
    listFees: "قراءة معلومات الرسوم",

    createInvoice: "إضافة فاتورة",
    updateInvoice: "تعديل فاتورة",
    deleteInvoice: "حذف فاتورة",
    listInvoices: "قراءة معلومات فاتورة",
    getInvoice: "قراءة معلومات فاتورة",
    exportInvoicesAsExcel: "تصدير معلومات الفواتير على شكل إكسل",
    downloadInvoiceImages: "تحميل صور الفاتورة",
    printInvoice: "طباعة معلومات الفاتورة",

    listUsers: "قراءة معلومات المستخدمين",
    readUser: "قراءة معلومات المستخدمين",
    createUser: "إضافة مستخدم",
    deleteUser: "حذف مستخدم",
    updateUser: "تعديل مستخدم",

    listRoles: "قراءة معلومات الأدوار",
    getRole: "قراءة معلومات الأدوار",
    createRole: "إضافة دور",
    deleteRole: "حذف دور",
    updateRole: "تعديل دور",
    listPermissions: "قراءة معلومات الأذونات",

    getInvoicesReport: "قراءة تقرير الفواتير",
    exportInvoicesReportAsExcel: "تصدير تقرير الفواتير على شكل إكسل",

    getDetailedPrints: "قراءة معلومات المطبوعات",
    updateDetailedPrints: "تعديل معلومات المطبوعات",
    updateFinesDate: "تعديل تاريخ الغرامات",
    updateReRegistrationtDate: "تعديل تاريخ إعادة القيد",

    getFixedDates: "قراءة معلومات التواريخ الثابتة",

    listBanks: "قراءة معلومات البنوك",
    getBank: "قراءة معلومات البنوك",
    createBank: "إنشاء بنك",
    updateBank: "تعديل بنك",
    deleteBank: "حذف بنك",

    printDocument: "طباعة وثيقة",
};

export const ReadablePermissions = {
    الصيدلي: [
        "إضافة صيدلي",
        "تعديل صيدلي",
        "حذف صيدلي",
        "قراءة معلومات الصيدلي",
        "تحميل صور الصيدلي",
        "تصدير معلومات الصيادلة على شكل إكسل",
        "طباعة معلومات الصيدلي",
    ],
    الرسوم: ["تعديل معلومات الرسوم", "قراءة معلومات الرسوم", "قراءة معلومات المطبوعات", "تعديل معلومات المطبوعات"],
    الفواتير: [
        "إضافة فاتورة",
        "تعديل فاتورة",
        "حذف فاتورة",
        "قراءة معلومات فاتورة",
        "تحميل صور الفاتورة",
        "تصدير معلومات الفواتير على شكل إكسل",
        "طباعة معلومات الفاتورة",
    ],
    المستخدمين: ["إضافة مستخدم", "تعديل مستخدم", "حذف مستخدم", "قراءة معلومات المستخدمين"],
    الأدوار: ["قراءة معلومات الأدوار", "قراءة معلومات الأذونات", "إضافة دور", "تعديل دور", "حذف دور"],
    "التواريخ الثابتة": ["تعديل تاريخ الغرامات", "تعديل تاريخ إعادة القيد", "قراءة معلومات التواريخ الثابتة"],
    التقارير: ["قراءة تقرير الفواتير", "تصدير تقرير الفواتير على شكل إكسل"],
    البنوك: ["قراءة معلومات البنوك", "إنشاء بنك", "تعديل بنك", "حذف بنك"],
    الديوان: ["طباعة وثيقة"],
};

export default permissions;
